# Пароль доступу до комп’ютера зберігається у змінній n - ціле число, яке вводить користувач. Напишіть програму, яка запитує пароль в користувача. У разі введення користувачем неправильного пароля на екран має виводитися повідомлення Error, після чого дії повинні повторюватися до введення правильного значення. При успішній аутентифікації в ситемі має з’явитися повідомлення Done.

p = input("Input password: ")
cp = input("Confirm password: ")
while cp != p:
    cp = input("Passwords do not match! Try again: ")
print("Done!")

    