# Напишіть програму, яка виводить двовимірну квадратну таблицю n x n чисел (n - ціле число, яке вводить користувач). По головній діагоналі таблиці (від лівого верхнього значення до нижнього правого значення) мають розміщуватися 0, вище головної діагоналі розміщуються 1, а нижче - -1. Для гарного відображення таблиці при виведенні її значень використовуйте символ табуляції \t.

n = int(input("Input number: "))
for i in range(n):
    row = ""
    for j in range(i):
        row += "-1\t"
    row += " 0\t"
    for j in range(n - i - 1):
        row += " 1\t"
    print(row)