# Як відомо, в США президент обирається не прямим голосуванням, а шляхом дворівневого голосування. Спочатку проводяться вибори в кожному штаті і визначається переможець виборів в даному штаті. Потім проводяться державні вибори: на цих виборах кожен штат має певну кількість голосів - число вибірників від цього штату. На практиці, всі виборці від штату голосують відповідно до результатів голосування в межах штату, тобто на заключній стадії виборів в голосуванні беруть участь штати, що мають різне число голосів. Вам відомо за кого проголосував кожен штат і скільки голосів було віддано даними штатом. Підведіть підсумки виборів: для кожного з учасника голосування визначте число відданих за нього голосів. Кожен рядок вхідного файлу містить прізвище кандидата, за якого віддають голоси виборці цього штату, потім через пропуск йде кількість голосів, які віддали за цього кандидата. Виведіть прізвища всіх кандидатів в лексикографічному порядку, потім, через пропуск, кількість відданих за них голосів.

from collections import defaultdict

candidate_votes = defaultdict(int)

file = open('input.txt')

for line in file:
    candidate, votes_str = line.strip().split()
    candidate_votes[candidate] += int(votes_str)

for candidate in sorted(candidate_votes.keys()):
    print(f"{candidate} {candidate_votes[candidate]}")
