# Напишіть програму, яка виводить число в стилі LCD-калькулятора. На вхід програми подається послідовність цифр, яку потрібно вивести на екран в спеціальному стилі. Розмір всіх цифр 4 символу в ширину і 7 символів у висоту. Між цифрами повинен бути один порожній стовпець. Перед першою цифрою не повинно бути пропусків. Виведені цифри повинні бути обведені рамочкою, в кутах якої знаходиться символ x, горизонтальна лінія створюється з символу -, а вертикальна - з символу вертикальної риски |. Користувач вводить рядок - послідовність цифр, а програма має вивести 9 рядків, що містять цифри, записані в зазначеному форматі.

lcd_digits = {
        '0': [' -- ', '|  |', '|  |', '    ', '|  |', '|  |', ' -- '],
        '1': ['    ', '   |', '   |', '    ', '   |', '   |', '    '],
        '2': [' -- ', '   |', '   |', ' -- ', '|   ', '|   ', ' -- '],
        '3': [' -- ', '   |', '   |', ' -- ', '   |', '   |', ' -- '],
        '4': ['    ', '|  |', '|  |', ' -- ', '   |', '   |', '    '],
        '5': [' -- ', '|   ', '|   ', ' -- ', '   |', '   |', ' -- '],
        '6': [' -- ', '|   ', '|   ', ' -- ', '|  |', '|  |', ' -- '],
        '7': [' -- ', '   |', '   |', '    ', '   |', '   |', '    '],
        '8': [' -- ', '|  |', '|  |', ' -- ', '|  |', '|  |', ' -- '],
        '9': [' -- ', '|  |', '|  |', ' -- ', '   |', '   |', ' -- ']
    }

def print_line(number):
    string = "x"
    hyphens = 5
    for digit in number:
        if digit in lcd_digits:
            for i in range(hyphens):
                string += '-'
            i += 1
    string += '-x'
    print(string)

def print_digit(number):
    for i in range(7):
        string = "| "
        for digit in number:
            if digit in lcd_digits:
                string += lcd_digits[digit][i]
                string += ' ' 
        print(f"{string}|")

def print_lcd(number): 
    print_line(number)
    print_digit(number)
    print_line(number)


number = input("Enter number: ")
print_lcd(number)